# 판다스

In [5]:
# 데이터 불러오기 
import pandas as pd
titanic_df = pd.read_csv('train.csv')
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

read_csv와 head() 함수를 통해 간단하게 데이터를 살펴볼 수 있다

In [6]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

info() 함수로 각 칼럼의 데이터타입과 크기 결측값 개수를 알 수 있다

In [7]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

describe() 함수로 수치데이터를 한눈에 확인할 수 있다 

최솟값과 최댓값의 차이가 크거나 평균값과 차이가 많이나는 경우 이상치로 판단할 수 있다

In [8]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

value_counts() 함수로 각 칼럼속의 데이터가 어떻게 분포해있는지 확인할 수 있다

In [10]:
#  넘파이 -> 데이터프레임 변환

import numpy as np

col_name1=['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)

df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)

1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3

list를 np.array() 함수로 ndarray 형태로 바꾼 뒤 pd.DataFrame() 함수로 데이터프레임 형태로 변환해주었다

이 때 칼럼명을 생성해야 할 필요가 있는 경우 따로 생성해주어야한다.

In [11]:
# 딕셔너리 -> 데이터프레임 변환

dict = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

딕셔너리의 키(key)는 칼럼명으로, 값(value)는 데이터로 변환시킬 수 있다

In [12]:
# 데이터프레임 -> 넘파이 변환

array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

.values 함수를 뒤에 붙이면 ndarray 형태로 변환할 수 있다

In [13]:
# 데이터프레임 -> 리스트 / 딕셔너리

list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

데이터프레임을 values를 이용해 넘파이 형태로 변환하고 이를 다시 리스트와 딕셔너리 형태로 변환하는 것이다.

.tolist() 함수와 .to_dict('') 함수를 이용해 각각 리스트와 딕셔너리로 변환할 수 있다

In [15]:
# 판다스 데이터 연산
titanic_df['Age_0']=0
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch']+1
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

titanic_df['칼럼명']=0 으로 0으로 채워진 칼럼을 추가할 수 있고

titanic_df['Age_by_10'] = titanic_df['Age']*10 처럼 기존 칼럼데이터를 연산한 값으로 새로운 칼럼을 생성할 수 있다

In [16]:
# 데이터프레임 삭제
titanic_drop_df = titanic_df.drop('Age_0', axis=1 )
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

titanic_df.drop('칼럼명', axis=1 ) 을 이용해 칼럼을 없앨 수 있다 (axis=1 이므로 '열'을 지움)

In [19]:
# 데이터프레임 인덱스 추출

indexes = titanic_df.index

이렇게 추출된 인덱스는 넘파이와 마찬가지로 반환 및 슬라이싱이 가능하다

In [21]:
series_fair = titanic_df['Fare']
print('Fair Series max 값:', series_fair.max())
print('Fair Series sum 값:', series_fair.sum())

titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

Fair Series max 값: 512.3292
Fair Series sum 값: 28693.9493

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

index가 연속된 숫자형 인덱스가 아닐 경우 reset_index를 이용행 연속 숫자형  index를 다시 생성할 수 있다.

In [31]:
# 데이터프레임 슬라이싱
titanic_df[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [38]:
#데이터프레임 불린 인덱싱
titanic_df[ titanic_df['Pclass'] == 3][['Name','Sex','Age']].head(3)

                       Name     Sex   Age
0   Braund, Mr. Owen Harris    male  22.0
2    Heikkinen, Miss. Laina  female  26.0
4  Allen, Mr. William Henry    male  35.0

어떤 형식인지 잘 외워두자 대괄호 안에 또 칼렴명과 조건쓰고 뒤에는 추출할 칼럼명 붙이기

In [39]:
# 위치 기반 인덱싱 iloc
titanic_df.iloc[0,3]

'Braund, Mr. Owen Harris'

대괄호 안에 형과 열의 위치 기반 인덱싱을 입력

In [40]:
# 명칭 기반 인덱싱 loc
titanic_df.loc[0,'Name']

'Braund, Mr. Owen Harris'

대괄호 안에 행에는 인덱스 값을 열에는 칼럼명을 입력

In [41]:
# 데이터프레임 정렬
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S,0,520.0,1
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S,0,260.0,3
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S,0,450.0,3

In [42]:
titanic_sorted = titanic_df.sort_values(by=['Name'])[::-1]
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,0,NaN,1
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S,0,505.0,3
361,362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,1,0,SC/PARIS 2167,27.7208,NaN,C,0,390.0,2

sort_valuse(by=['칼럼명']) 함수를 이용해 특정 칼럼 데이터의 오름차순으로 정렬할 수 있고 

[::-1]을 붙이거나 ascending=False를 넣으면 내림차순으로 정렬된다

In [43]:
# 데이터프레임 agg 함수
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

특정 칼럼에 agg 함수를 적용할 수 있다

In [45]:
# 데이터프레임 그룹화
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

groupby('칼럼명') 함수를 이용해 특정 칼럼의 데이터값으로 그룹화를 시킬 수 있다

위의 표는 Pclass값 1,2,3에 따라 특정 칼럽을 그룹화 시킨 것이다

그룹화시킨 데이터프레임에도 마찬가지로 agg함수를 적용할 수 있다

In [47]:
# 결손 데이터 처리
titanic_df.isna( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Age_0            0
Age_by_10      177
Family_No        0
dtype: int64

isna() 함수로 결측치를 확인할 수 있다

In [51]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df = titanic_df.interpolate(method = 'linear')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
Age_0          0
Age_by_10      0
Family_No      0
dtype: int64

fillna() 함수로 결측치를 특정한 값으로 대체할 수 있다

또다른 방법으로는 interpolate()함수를 적용하는 것이다 (수치형 결측치)

In [52]:
# lambda 함수 이용
lambda_square = lambda x : x ** 2
print('3의 제곱은:',lambda_square(3))

3의 제곱은: 9

lambda 는 함수의 선언과 처리를 한줄로 간단하게 할 수 있다 이를 잘 활용해보자

lambda x : x**2 에서 처음 x는 입력 인자를 뜻하고 : 뒤의 식은 입력인자를 계산할 함수식이다

In [53]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x <= 60 else 
                                                                                  'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      770
Child       98
Elderly     23
Name: Age_cat, dtype: int64

위와같이 apply() 함수와 lambda를 이용해 데이터를 분류할 수 있다

In [54]:
# 나이에 따라 세분화된 분류를 수행하는 함수 생성. 
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

# lambda 식에 위에서 생성한 get_category( ) 함수를 반환값으로 지정. 
# get_category(X)는 입력값으로 ‘Age’ 컬럼 값을 받아서 해당하는 cat 반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age','Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult

조건이 여러개인 경우 def함수생성을 이용해 조건식을 만들고 lambda에 한번에 적용시키는 방법도 있다